src/boundaryConditions/dynContactAngleModel/robinBC/growingDroplet3D/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type    zeroGradient;
    }

    right
    {
        type    zeroGradient;
    }

    front
    {
        type    zeroGradient;
    }

    back
    {
        type    zeroGradient;
    }

    top
    {
        type    zeroGradient;
    }

    inlet
    {
        type                flowRateInletVelocity;
        // Express flow rate as fraction of droplet volume.
        // Use expression from https://en.wikipedia.org/wiki/Spherical_cap 
        pi          3.141592653589793;
        r           0.001; // drop radius
        theta0      #eval{60*$pi/180};
        fraction    0.1;
        volumetricFlowRate  #eval{$fraction*$pi/3.0*$r*$r*$r*(2.0 + cos($theta0))*(1.0 - cos($theta0))*(1.0 - cos($theta0))};
        extrapolateProfile  no;
        value               uniform (0 0 0);
    }

    bottomRemainder
    {
        type            noSlip;
    }
}

// ************************************************************************* //


